In [1]:
import numpy as np
import pandas as pd

In [2]:
a=np.random.random((10, 4))
a

array([[0.91307654, 0.96424331, 0.69772105, 0.11319774],
       [0.61261598, 0.01987087, 0.01484774, 0.84831847],
       [0.16730075, 0.00636058, 0.78010862, 0.54641151],
       [0.39104204, 0.69267036, 0.78189439, 0.3493422 ],
       [0.69974175, 0.26044926, 0.8124182 , 0.53406236],
       [0.54372574, 0.79081493, 0.38325951, 0.82189007],
       [0.6361207 , 0.92186691, 0.44798296, 0.20542455],
       [0.33047025, 0.43298393, 0.70650174, 0.97187498],
       [0.3038021 , 0.82917853, 0.89604531, 0.44190616],
       [0.63415389, 0.61134911, 0.63541547, 0.70726327]])

In [3]:
df=pd.DataFrame(a, columns=['uno', 'dos', 'tres', 'cuatro'])

df

        uno       dos      tres    cuatro
0  0.913077  0.964243  0.697721  0.113198
1  0.612616  0.019871  0.014848  0.848318
2  0.167301  0.006361  0.780109  0.546412
3  0.391042  0.692670  0.781894  0.349342
4  0.699742  0.260449  0.812418  0.534062
5  0.543726  0.790815  0.383260  0.821890
6  0.636121  0.921867  0.447983  0.205425
7  0.330470  0.432984  0.706502  0.971875
8  0.303802  0.829179  0.896045  0.441906
9  0.634154  0.611349  0.635415  0.707263

In [4]:
df['tres']

0    0.697721
1    0.014848
2    0.780109
3    0.781894
4    0.812418
5    0.383260
6    0.447983
7    0.706502
8    0.896045
9    0.635415
Name: tres, dtype: float64

In [5]:
df.tres

0    0.697721
1    0.014848
2    0.780109
3    0.781894
4    0.812418
5    0.383260
6    0.447983
7    0.706502
8    0.896045
9    0.635415
Name: tres, dtype: float64

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
type(df.tres)

pandas.core.series.Series

In [8]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 'Pension Roma'], 
                      'stars':[5,4,2], 'Precio':[800, 500, 100]})

hoteles

         nombre  stars  Precio
0        Palace      5     800
1          Ritz      4     500
2  Pension Roma      2     100

In [9]:
hoteles.dtypes

nombre    object
stars      int64
Precio     int64
dtype: object

In [10]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 0], 
                      'stars':[5,4,2], 'Precio':[800, 500, 100]})

hoteles.dtypes

nombre    object
stars      int64
Precio     int64
dtype: object

In [11]:
hoteles

   nombre  stars  Precio
0  Palace      5     800
1    Ritz      4     500
2       0      2     100

In [12]:
hoteles.shape

(3, 3)

In [13]:
hoteles['ratio']=hoteles.stars/hoteles.Precio

hoteles

   nombre  stars  Precio    ratio
0  Palace      5     800  0.00625
1    Ritz      4     500  0.00800
2       0      2     100  0.02000

In [14]:
hoteles.T

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [16]:
hoteles.transpose()

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [17]:
hoteles.sum()

stars       11.00000
Precio    1400.00000
ratio        0.03425
dtype: float64

In [18]:
hoteles.max()

stars       5.00
Precio    800.00
ratio       0.02
dtype: float64

In [19]:
hoteles.mean()

stars       3.666667
Precio    466.666667
ratio       0.011417
dtype: float64

In [20]:
hoteles.median()

stars       4.000
Precio    500.000
ratio       0.008
dtype: float64

In [21]:
type(hoteles.median())

pandas.core.series.Series

In [22]:
hoteles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
nombre    3 non-null object
stars     3 non-null int64
Precio    3 non-null int64
ratio     3 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [23]:
hoteles.describe()

          stars      Precio     ratio
count  3.000000    3.000000  3.000000
mean   3.666667  466.666667  0.011417
std    1.527525  351.188458  0.007485
min    2.000000  100.000000  0.006250
25%    3.000000  300.000000  0.007125
50%    4.000000  500.000000  0.008000
75%    4.500000  650.000000  0.014000
max    5.000000  800.000000  0.020000

In [24]:
hoteles.describe().T

,count,mean,std,min,25%,50%,75%,max
stars,3.0,3.666667,1.527525,2.00000,3.000000,4.000,4.500,5.00
Precio,3.0,466.666667,351.188458,100.00000,300.000000,500.000,650.000,800.00
ratio,3.0,0.011417,0.007485,0.00625,0.007125,0.008,0.014,0.02

In [25]:
hoteles.describe().T['std']

stars       1.527525
Precio    351.188458
ratio       0.007485
Name: std, dtype: float64

In [28]:
pd.read_csv('data/alumnos.csv', sep=',')

  Nombre  Edad
0   Pepe    10
1   Juan    20
2   Luis    25
3   Fran  15xº

In [29]:
pd.read_json('data/alumnos.json')

  nombre  edad                                          aficiones
0   Pepe    10  [{'name': 'Beisbol', 'level': 2}, {'name': 'Fu...

In [33]:
pd.read_json('data/alumnos.json')['aficiones'][0]

[{'name': 'Beisbol', 'level': 2},
 {'name': 'Futbol', 'level': 1},
 {'name': 'Esgrima', 'level': 10}]

In [34]:
from pandas.io.json import json_normalize

In [38]:
df_json=pd.read_json('data/alumnos.json')

df_json

  nombre  edad                                          aficiones
0   Pepe    10  [{'name': 'Beisbol', 'level': 2}, {'name': 'Fu...

In [41]:
json_normalize(df_json.aficiones[0])

      name  level
0  Beisbol      2
1   Futbol      1
2  Esgrima     10

In [42]:
df2=pd.DataFrame()

for e in df_json.aficiones[0]:
    df2=df2.append(e, ignore_index=True)

In [43]:
df2

   level     name
0    2.0  Beisbol
1    1.0   Futbol
2   10.0  Esgrima